Обработки/Reports/_КонтрольОстатковЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольОстатковЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодИнтервал</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводимыеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольОстатковЦенныхБумаг/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.ВидУчета		= Перечисления.ВидыУчета.БухгалтерскийУчет;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	РаботаСОтчетами.ЗапомнитьКлючВариантаОтчета(Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	Если Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("АдресФайлаНСД") Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Удалить("АдресФайлаНСД");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если (ЭтаФорма.КлючТекущегоВарианта = "СЧА"
			Или ЭтаФорма.КлючТекущегоВарианта = "ФинРез") 
		И Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.ПериодИнтервал,,, ТекстСообщения)
	Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.ПериодИнтервал.Дата" + ?(Лев(ТекстСообщения, 9) = "Окончание"  , "Окончания", "Начала"), Отказ);
	КонецЕсли;
	
	Если ЭтаФорма.КлючТекущегоВарианта = "СверкаСДаннымиНСД" Тогда
		
		ПроверяемыеРеквизиты.Добавить("ПутьКФайлуНСД");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Отчет.ПериодИнтервал.ДатаНачала		= Отчет.Период;
	Отчет.ПериодИнтервал.ДатаОкончания	= Отчет.Период;
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	Отчет.Период = Отчет.ПериодИнтервал.ДатаОкончания;	
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводимыеДниПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеятельностиПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНСДОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	
	Если ПустаяСтрока(ЭтаФорма.ПутьКФайлуНСД) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложение(ЭтаФорма.ПутьКФайлуНСД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНСДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xls;*.xlsx)|*.xls;*.xlsx";

	Если ДиалогВыбора.Выбрать() Тогда
		
		ЭтаФорма.ПутьКФайлуНСД = ДиалогВыбора.ПолноеИмяФайла;
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНСДПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	Если ЭтаФорма.КлючТекущегоВарианта = "СверкаСДаннымиНСД" И ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоляЭлементаРасшифровки = ПолучитьПоляЭлементаРасшифровки(Расшифровка, ЭтаФорма.ДанныеРасшифровки);
        
		Если ПоляЭлементаРасшифровки.Свойство("РасшифровкаРасчета") Тогда
			РасшифровкаЗначения = ПоляЭлементаРасшифровки.РасшифровкаРасчета;
		ИначеЕсли ПоляЭлементаРасшифровки.Свойство("СверкаСДаннымиНСД_ПредставлениеПартии") Тогда
			РасшифровкаЗначения = ПоляЭлементаРасшифровки.СверкаСДаннымиНСД_ПредставлениеПартии;
		Иначе
			РасшифровкаЗначения = Неопределено;
		КонецЕсли;
		
		Если РасшифровкаЗначения <> Неопределено Тогда
			
			ДополнительныеДействия = Новый СписокЗначений;
			ДополнительныеДействия.Добавить("ОткрытьЗначение", "Открыть значение");	
			
			ВыполненноеДействие = Неопределено;
		
			ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ЭтаФорма.ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтотОбъект.Отчет));
			ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, Неопределено, Новый Массив, ДополнительныеДействия);		
			
			Если ВыполненноеДействие = "ОткрытьЗначение" Тогда
				
				ОткрытьЗначение(РасшифровкаЗначения);
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСформировать(Команда)

	Если ЭтаФорма.КлючТекущегоВарианта = "СверкаСДаннымиНСД" Тогда
		
		#Область Получаем_двоичные_данные_файла_НСД
		
		Если ЗначениеЗаполнено(ЭтаФорма.ПутьКФайлуНСД) Тогда
				
			Попытка
				
 				АдресПомещаемогоФайла = 
					?(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("АдресФайлаНСД")
							И ЭтоАдресВременногоХранилища(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.АдресФайлаНСД),
						Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.АдресФайлаНСД,
						ЭтаФорма.УникальныйИдентификатор);
				
				АдресФайлаНСД = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ЭтаФорма.ПутьКФайлуНСД), АдресПомещаемогоФайла);
			
				Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("АдресФайлаНСД", АдресФайлаНСД);
			
			Исключение
				
				ИнфоОбОшибке = ИнформацияОбОшибке();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла: " + КраткоеПредставлениеОшибки(ИнфоОбОшибке), , "ПутьКФайлуНСД");
				Возврат;
				
			КонецПопытки;

		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;	
	
	ЭтаФорма.СкомпоноватьРезультат();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Отчет.ПериодИнтервал.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Отчет.ПериодИнтервал.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Отчет.ПериодИнтервал.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		Отчет.ПериодИнтервал.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
		Отчет.Период						= Отчет.ПериодИнтервал.ДатаОкончания;
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПроверитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_и_вспомогательные_функции 

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	
	Элементы = ЭтаФорма.Элементы;	
	
	Элементы.ГруппаПериодИнтервал.Видимость	= (ЭтаФорма.КлючТекущегоВарианта = "СЧА" ИЛИ ЭтаФорма.КлючТекущегоВарианта = "ФинРез"); 
	Элементы.Период.Видимость				= Не Элементы.ГруппаПериодИнтервал.Видимость И Не ЭтаФорма.КлючТекущегоВарианта = "СверкаСДаннымиНСД";
	Элементы.ПутьКФайлуНСД.Видимость		= ЭтаФорма.КлючТекущегоВарианта = "СверкаСДаннымиНСД";
	
	Элементы.ВидУчета.Видимость =
		ЭтаФорма.КлючТекущегоВарианта = "СЧА" 
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "СверкаСуммБУ_НУ"
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "СверкаСПереоценкой"
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "СверкаРЕПО"
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "ПоКоличествуИВидуУчета"
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "ПартииРСБУ_НУ"
		ИЛИ ЭтаФорма.КлючТекущегоВарианта = "СверкаПоДС";
	
	Элементы.ГруппаРасширенныйОтбор.Видимость		= (ЭтаФорма.КлючТекущегоВарианта = "СЧА");
	Элементы.ВидДеятельности.Видимость				= (ЭтаФорма.Отчет.РежимОтбора = 1);
	Элементы.ВидДоговора.Видимость					= (ЭтаФорма.Отчет.РежимОтбора = 2);
	
	Если ЭтаФорма.КлючТекущегоВарианта = "СЧА" Тогда
		Элементы.СчетДоверительногоУправления.Видимость				= (ЭтаФорма.Отчет.РежимОтбора = 0);
		Элементы.СчетДоверительногоУправления.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет; 
	Иначе
		Элементы.СчетДоверительногоУправления.Видимость				= Истина;
		Элементы.СчетДоверительногоУправления.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
	КонецЕсли;

	Элементы.ВидУчета.СписокВыбора.Очистить();
	Элементы.ВидУчета.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыУчета.БухгалтерскийУчет"));
	Элементы.ВидУчета.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыУчета.НалоговыйУчет"));
	Если ЭтаФорма.КлючТекущегоВарианта <> "СверкаСПереоценкой" Тогда
		Элементы.ВидУчета.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ВариантыОтчета = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек;
	
	Для Каждого Вариант ИЗ ВариантыОтчета Цикл		
		Если Вариант.Имя = ИмяВарианта Тогда
			ОтчетОбъект.Проверка(Новый Структура("Организация, Период, Счет, Настройка, Вариант, ВидУчета", 
				Отчет.Организация, Отчет.Период, Отчет.СчетДоверительногоУправления, Вариант.Настройки, Вариант.Имя, Отчет.ВидУчета));
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоляЭлементаРасшифровки(Расшифровка = Неопределено, АдресРасшифровки = Неопределено, Знач ЭлементРасшифровки = Неопределено, Знач ДанныеРасшифровки = Неопределено, ПоляЭлементаРасшифровки = Неопределено)
	
	Если ПоляЭлементаРасшифровки = Неопределено Тогда 
		ПоляЭлементаРасшифровки = Новый Структура;
	КонецЕсли;
	
	Если ДанныеРасшифровки = Неопределено Тогда 
		ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	КонецЕсли;
	
	Если ЭлементРасшифровки = Неопределено Тогда 
		ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
	КонецЕсли;

	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		
		Для Каждого ПолеРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			
			Если СтрЗаканчиваетсяНа(ПолеРасшифровки.Поле, "1С_Расшифровка") И ТипЗнч(ПолеРасшифровки.Значение) = Тип("ХранилищеЗначения") Тогда
				
				СтруктураРасшифровки = ПолеРасшифровки.Значение.Получить();
				
				Если ТипЗнч(СтруктураРасшифровки) = Тип("Структура") Тогда	
				
					Формула			= СтруктураРасшифровки.Формула;
					ДлинаФормулы	= СтрДлина(Формула);
					СтрокаДанных1С	= СтруктураРасшифровки.СтрокаДанных1С;
					
					// Раскладываем формулу на компоненты.
					// Если длина компоненты больше одного символа - вычисляем.
					// Если после вычисления значение компоненты поменялось,
					// добавляем его справа от исходного в квадратных скобках.
					
					Компонента					= "";
					Разделители					= " 	/*+-?()<>,"; // операторы и пробельные символы
					МассивОбработанныхКомпонент	= Новый Массив;
					
					Для НомерСимвола = 1 По ДлинаФормулы Цикл
						
						Символ				= Сред(Формула, НомерСимвола, 1);
						ПозицияРазделителя	= СтрНайти(Разделители, Символ);
						
						Если ПозицияРазделителя > 0 ИЛИ НомерСимвола = ДлинаФормулы Тогда
							
							Если ПозицияРазделителя = 0 И НомерСимвола = ДлинаФормулы Тогда
								Компонента = Компонента + Символ;		
							КонецЕсли;
							
							Если Не ПустаяСтрока(Компонента) Тогда
							
								ОбработаннаяКомпонента = ?(СтрДлина(Компонента) <= 1, Компонента, Вычислить(Компонента));
								
								Если Компонента <> ОбработаннаяКомпонента Тогда
									ОбработаннаяКомпонента = СтрШаблон("%1 [%2]", Компонента, ОбработаннаяКомпонента);
								КонецЕсли;
														
								МассивОбработанныхКомпонент.Добавить(ОбработаннаяКомпонента);												
															
								Компонента = "";
								
							КонецЕсли; 
							
							Если ПозицияРазделителя > 0 Тогда
								МассивОбработанныхКомпонент.Добавить(Символ);
							КонецЕсли;
							
						Иначе
							Компонента = Компонента + Символ;
						КонецЕсли;
						
					КонецЦикла;
					
					// Преобразуем в более понятный вид
					
					РасшифровкаРасчета = СтрСоединить(МассивОбработанныхКомпонент);
					РасшифровкаРасчета = СтрЗаменить(РасшифровкаРасчета, "СтрокаДанных1С.", "");
					РасшифровкаРасчета = СтрЗаменить(РасшифровкаРасчета, "?", "ЕСЛИ");
					
					ПоляЭлементаРасшифровки.Вставить("РасшифровкаРасчета", РасшифровкаРасчета);
					
				КонецЕсли;
				
			Иначе
				ПоляЭлементаРасшифровки.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ПолеРодителя Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ПолучитьПоляЭлементаРасшифровки( , , ПолеРодителя, ДанныеРасшифровки, ПоляЭлементаРасшифровки);	
	КонецЦикла;	
	
	Возврат ПоляЭлементаРасшифровки;
    
КонецФункции

#КонецОбласти
